Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: Popular in Kids
cy: Poblogaidd yn Rhaglenni Plant

source: Painkillers
cy: Poenladdwyr

source: Cookie Policy
cy: Polisi Cwcis

source: Privacy Policy
cy: Polisi Preifatrwydd

source: Polyline
cy: Polylinell

source: Pop (Africa)
cy: Pop (Affrica)

source: Pop (Russia)
cy: Pop (Rwsia)

source: Purple
cy: Porffor

source: Browse
cy: Pori

source: Browse and shop your favourites
cy: Pori a siopa ar gyfer eich ffefrynnau

source: Browse different styles and categories
cy: Pori gwahanol arddulliau a chategorïau

source: puzzle, intertwined, wander, wandering, hiking, journey, forest, woods, tree, explore, [APPNAME]phere
cy: pos, plethu, mynd am dro, crwydro, heicio, taith, fforest, coedwigoedd, coeden, archwilio, awyrgylch

source: Possible data corruption
cy: Posib bod y data yn llwgr

source: Unsent posts
cy: Postiadau heb eu hanfon

source: New post from friends
cy: Postiadau newydd gan ffrindiau

source: Free shipping!
cy: Postio am ddim!

source: Post It
cy: Postio am hwn

source: Post tip
cy: Postio awgrym

source: Post new tip
cy: Postio awgrym newydd

source: Post Task content to Facebook
cy: Postio cynnwys y dasg i Facebook

source: Post later
cy: Postio yn ddiweddarach

source: Post your problem
cy: Postio'ch problem

source: Posted
cy: Postiwyd

source: Posted %s
cy: Postiwyd %s

source: Private
cy: Preifat

source: Open private
cy: Preifat agored

source: Privacy
cy: Preifatrwydd

source: Present, Nasal/Honky
cy: Presennol, Trwynol/Honci

source: Attendance
cy: Presenoldeb

source: Head Coach
cy: Prif Hyfforddwr

source: Top News
cy: Prif Newyddion

source: Highway
cy: Priffordd

source: Auto-capitalise
cy: Priflythrennu yn awtomatig

source: University
cy: Prifysgol

source: Properties
cy: Priodweddau

source: Price
cy: Pris

source: Meal price
cy: Pris bwyd

source: Unit price
cy: Pris yr uned

source: iCloud Authorization Problem
cy: Problem wrth awdurdodi iCloud

source: Problem Purchasing: %@
cy: Problem wrth brynu: %@

source: Facebook auth problem
cy: Problem wrth ddilysu Facebook

source: Twitter auth problem
cy: Problem wrth ddilysu Twitter

source: Facebook Access Problem
cy: Problem yn cael mynediad at Facebook

source: Issues
cy: Problemau

source: Known issues
cy: Problemau hysbys

source: Profile
cy: Proffil

source: [USERNAME]’s profile
cy: Proffil [USERNAME]

source: PROFILE & SETTINGS
cy: PROFFIL A GOSODIADAU

source: User profile
cy: Proffil defnyddiwr

source: Employee Profile
cy: Proffil Gweithiwr

source: Blogger Profile
cy: Proffil y Blogiwr

source: Profile loading…
cy: Proffil yn llwytho…

source: Game Tester & QA
cy: Profwr y Gêm a Sicrhau Ansawdd

source: Purchase incomplete.
cy: Proses prynu anghyflawn.

source: Project
cy: Prosiect

source: Project 1
cy: Prosiect 1

source: Project 2
cy: Prosiect 2

source: Project 3
cy: Prosiect 3

source: Project and task
cy: Prosiect a thasg

source: Default project
cy: Prosiect diofyn

source: New project
cy: Prosiect newydd

source: Projects
cy: Prosiectau

source: Projects to export
cy: Prosiectau i'w hallgludo

source: Purchases
cy: Pryniannau

source: Buy
cy: Prynu

source: Purchase
cy: Prynu

source: Purchasing
cy: Prynu

source: Purchase (%@)
cy: Prynu (%@)

source: Buy for %@
cy: Prynu am %@

source: Purchase For %@
cy: Prynu am %@

source: Purchase or Restore
cy: Prynu neu adfer

source: Purchase subscription
cy: Prynu tanysgrifiad

source: Buying Upgrade
cy: Prynu uwchraddiad

source: Buy Full Version
cy: Prynu'r fersiwn llawn

source: Purchased
cy: Prynwyd

source: Psst. Did you know you can paste a video link in the search bar?
cy: Psst. Oeddech chi'n gwybod eich bod yn gallu gludo dolen fideo yn y bar chwilio?

source: Power
cy: Pŵer

source: Subject
cy: Pwnc

source: Email subject
cy: Pwnc yr e-bost

source: Who
cy: Pwy

source: Who should I follow?
cy: Pwy dylwn i ddilyn?

source: Last Laughs
cy: Pwy sy'n chwerthin olaf

source: Who can view my friend list?
cy: Pwy sy'n gallu gweld fy rhestr ffrindiau?

source: Corner point
cy: Pwynt cornel

source: Points (pt)
cy: Pwyntiau (pt)

source: Pressure
cy: Pwysau

source: Penny Weights
cy: Pwysau Ceiniog

source: Long-press and drag to reorder tasks.
cy: Pwyso'n hir a llusgo i aildrefnu tasgau.

source: Poundals
cy: Pwysolau

source: Press '+',
cy: Pwyswch '+',

source: Press and hold to record
cy: Pwyswch a dal i recordio

source: Press Create Subtask,
cy: Pwyswch Creu Is-dasg,

source: Press Delete Event,
cy: Pwyswch Dileu Digwyddiad,

source: Press Edit,
cy: Pwyswch Golygu,

source: Tap to Record
cy: Pwyswch i Recordio

source: Tap to record & send
cy: Pwyswch i recordio ac anfon

source: Tap to record and send your reply
cy: Pwyswch i recordio ac anfon eich ateb

source: Tap to record video message
cy: Pwyswch i recordio neges fideo

source: Push to talk
cy: Pwyswch i siarad

source: Press Done, and Done again.
cy: Pwyswch Wedi gorffen, a Wedi gorffen eto.

source: Press Done.
cy: Pwyswch Wedi gorffen.

source: Press the Delete button,
cy: Pwyswch y botwm Dileu,

source: Press the filter button on Then or Chart and set a suitable range of times.
cy: Pwyswch y botwm hidlydd ar Wedyn neu Siart a gosodwch amrywiaeth addas o amser.

source: Press the filter button on Then or Chart and set Filter by task to <em>Work</em>.
cy: Pwyswch y botwm hidlydd ar Wedyn neu Siart a gosodwch Hidlo yn ôl tasg i <em>Gwaith</em>.

source: Long-press on it, until it lifts up,
cy: Pwyswch yn hir arni, nes iddo godi,

source: Long-press to add
cy: Pwyswch yn hir i ychwanegu

source: Long-press to add event
cy: Pwyswch yn hir i ychwanegu digwyddiad

source: Long-press directly at the time you want the event to start at.
cy: Pwyswch yn hir yn uniongyrchol ar yr amser pan rydych eisiau i'r digwyddiad gychwyn.

source: Pools, Tools, and Fools
cy: Pyllau, Offer, a Ffyliaid

source: Fade
cy: Pylu

source: Other Topics
cy: Pynciau Eraill

source: Puppetry
cy: Pypedwaith

source: last 2 weeks
cy: pythefnos ddiwethaf

source: Fortnights
cy: Pythefnosau

source: Prediction
cy: Rhagfynegiad

source: Good Call!
cy: Rhagfynegiad Da!

source: Predictions
cy: Rhagfynegiadau

source: December
cy: Rhagfyr

source: KIDS SHOWS
cy: RHAGLENNI PLANT

source: Hit TV shows and special interest episodes
cy: Rhaglenni teledu poblogaidd a phenodau o ddiddordeb arbennig

source: Preview
cy: Rhagolwg

source: Hourly Forecast
cy: Rhagolwg bob awr

source: Daily Forecast
cy: Rhagolwg dyddiol

source: Way to go!
cy: Rhagorol!

source: Outpost
cy: Rhagorsaf

source: You must select an answer before submitting.
cy: Rhaid i chi ddewis ateb cyn cyflwyno.

source: You have to select at least one project
cy: Rhaid i chi ddewis o leiaf un prosiect

source: You must allow [APPNAME] to access your contacts in order to import from Address Book.
cy: Rhaid i chi ganiatáu i [APPNAME] gael mynediad at eich cysylltiadau er mwyn mewngludo o'r Llyfr Cyfeiriadau.

source: You have to setup an e-mail account first!
cy: Rhaid i chi osod cyfrif e-bost yn gyntaf!

source: You have to select start and end date
cy: Rhaid i ddewis dyddiad cychwyn a gorffen

source: Username length must be between 2 and 25 characters
cy: Rhaid i hyd yr enw defnyddiwr fod rhwng 2 a 25 cymeriad

source: Screen name length must be between 2 and 25 characters
cy: Rhaid i hyd yr enw sgrin fod rhwng 2 a 25 cymeriad

source: Your password must be at least 8 characters in length
cy: Rhaid i'ch cyfrinair fod o leiaf 8 llythyren o hyd

source: Confirmation code must be a 4 digit number
cy: Rhaid i'r cod cadarnhau fod yn rhif 4 digid

source: Password needs to be at least 6 characters long.
cy: Rhaid i'r cyfrinair fod o leiaf 6 llythyren o hyd.

source: Password must contain at least %1$s characters
cy: Rhaid i'r cyfrinair gynnwys o leiaf %1$s nod

source: Password must contain at least 6 characters
cy: Rhaid i'r cyfrinair gynnwys o leiaf 6 nod

source: Password must contain at least 8 alpha-numeric characters.
cy: Rhaid i'r cyfrinair gynnwys o leiaf 8 nod alffaniwmerig.

source: Display name has to be at least [COUNT] characters
cy: Rhaid i'r enw arddangos fod o leiaf [COUNT] nod

source: Username must start with a letter. Can contain letters, numbers and non consecutive periods or underscores.
cy: Rhaid i'r enw defnyddiwr gychwyn gyda llythyren. Gall gynnwys tanlinellau, llythrennau, rhifau ac atalnodau llawn nad sydd yn olynol.

source: Username must contain at least %1$s characters
cy: Rhaid i'r enw defnyddiwr gynnwys o leiaf %1$s nod

source: Name must contain at least %1$s characters
cy: Rhaid i'r enw gynnwys o leiaf %1$s nod

source: The cost must be between 0 and 20
cy: Rhaid i'r gost fod rhwng 0 a 20

source: Group must have at least 2 other people
cy: Rhaid i'r grŵp gael o leiaf 2 berson eraill

source: Value must be between 1 and 40
cy: Rhaid i'r gwerth fod rhwng 1 a 40

source: Value must be between 5 and 20
cy: Rhaid i'r gwerth fod rhwng 5 ac 20

source: Romance
cy: Rhamant

source: Share
cy: Rhannu

source: Share great moments with all your friends.
cy: Rhannu adegau gwych gyda'ch holl ffrindiau.

source: Share Schedule
cy: Rhannu Amserlen

source: Share via Mail, Messages, and social services such as Facebook or Twitter.
cy: Rhannu ar e-bost, negeseuon a gwasanaethau cymdeithasol fel Facebook neu Twitter.

source: Share on Facebook
cy: Rhannu ar Facebook

source: Share on Instagram
cy: Rhannu ar Instagram

source: Share on Twitter
cy: Rhannu ar Twitter

source: Share tip
cy: Rhannu awgrym

source: Share Data
cy: Rhannu Data

source: Share data only
cy: Rhannu data yn unig

source: Share image and data
cy: Rhannu delwedd a data

source: Share image only
cy: Rhannu delwedd yn unig

source: Share Images
cy: Rhannu Delweddau

source: Share by Email
cy: Rhannu drwy e-bost

source: Share CSV data files
cy: Rhannu ffeiliau data CSV

source: Share using
cy: Rhannu gan ddefnyddio

source: Share Photo
cy: Rhannu llun

source: Share profile
cy: Rhannu proffil

source: Internet sharing
cy: Rhannu Rhyngrwyd

source: Share score
cy: Rhannu sgôr

source: Share Chat Screenshot.
cy: Rhannu sgrinlun o'r sgwrs.

source: Sharing disabled
cy: Rhannu wedi'i analluogi

source: Share stats
cy: Rhannu ystadegau

source: Share It!
cy: Rhannu!

source: Share your profile
cy: Rhannu'ch proffil

source: Share this map…
cy: Rhannu'r map hwn…

source: Share this post
cy: Rhannu'r post hwn

source: Share your upcoming schedule by email or text message
cy: Rhannwch eich amserlen nesaf drwy e-bost neu neges destun

source: Share your idea
cy: Rhannwch eich syniad

source: Share your idea here…
cy: Rhannwch eich syniad yma…

source: Share the conversation on WhatsApp, Facebook, Instagram or Twitter!
cy: Rhannwch y sgwrs ar WhatsApp, Facebook, Instagram neu Twitter!

source: Run
cy: Rhedeg

source: Run %@ Step
cy: Rhedeg %@ Cam

source: Run %@ Steps
cy: Rhedeg %@ Cam

source: Run %@ KM
cy: Rhedeg %@ KM

source: Run %@ Mile
cy: Rhedeg %@ Milltir

source: Run %@ Miles
cy: Rhedeg %@ Milltir

source: Car Rental
cy: Rhentu car

source: Passport control
cy: Rheolaeth pasbort

source: Regular
cy: Rheolaidd

source: Scheduled
cy: Rheolaidd

source: Calendar Control
cy: Rheoli Calendr

source: Manage Contexts
cy: Rheoli cyd-destunau

source: Data management
cy: Rheoli data

source: Manage Data
cy: Rheoli Data

source: Manage Locations
cy: Rheoli lleoliadau

source: Manage Projects
cy: Rheoli prosiectau

source: Manage Tags
cy: Rheoli Tagiau

source: Subscription management
cy: Rheoli tanysgrifiad

source: Manage your commute
cy: Rheoli'ch cymudo

source: Manage subscription
cy: Rheoli'r tanysgrifiad

source: Manager
cy: Rheolwr

source: Manager / Supervisor
cy: Rheolwr / Goruchwyliwr

source: Manager/Contact details
cy: Rheolwr/Manylion cyswllt

source: Streak
cy: Rhes

source: List
cy: Rhestr

source: Current Roster
cy: Rhestr Bresennol

source: CURRENT ROSTER
cy: RHESTR BRESENNOL

source: Black List
cy: Rhestr ddu

source: Wishlist
cy: Rhestr Dymuniadau

source: Focus List
cy: Rhestr ffocus

source: Duties List:
cy: Rhestr o Ddyletswyddau:

source: Complete settings listing:
cy: Rhestr o'r holl osodiadau:

source: Packing list
cy: Rhestr pacio

source: Todo list
cy: Rhestr tasgau

source: Checklist
cy: Rhestr wirio

source: Checklist and Notes
cy: Rhestr Wirio a Nodiadau

source: Block list
cy: Rhestr y sawl wedi'u blocio

source: FEATURED LISTINGS
cy: RHESTRIADAU DAN SYLW

source: Reasons to upgrade
cy: Rhesymau dros uwchraddio

source: PAUSE
cy: RHEWI

source: Game Paused
cy: Rhewyd y gêm

source: Number
cy: Rhif

source: Phone number
cy: Rhif ffôn

source: Invalid phone number
cy: Rhif ffôn annilys

source: Invalid phone number. Please ensure that your number is in international format
cy: Rhif ffôn annilys. Sicrhewch fod eich rhif mewn fformat rhyngwladol

source: Invoice number
cy: Rhif yr anfoneb

source: Digits only
cy: Rhifau yn unig

source: Keep
cy: Rhoi

source: Give and Take
cy: Rhoi a Derbyn

source: Report
cy: Rhoi gwybod

source: Report a Problem
cy: Rhoi gwybod am broblem

source: Report Problem
cy: Rhoi gwybod am broblem

source: Report a Bug
cy: Rhoi Gwybod am Chwilen

source: Report Abuse
cy: Rhoi gwybod am gamddefnydd

source: Cancelation report
cy: Rhoi gwybod am ganslo hediad

source: Report a delay
cy: Rhoi gwybod am oedi

source: Report delay
cy: Rhoi gwybod am oedi

source: report a delay?
cy: rhoi gwybod am oedi?

source: Report inappropriate
cy: Rhoi gwybod am rywbeth anaddas

source: Report bad behaviour
cy: Rhoi gwybod am ymddygiad drwg

source: Notify Me When
cy: Rhoi gwybod i mi pan

source: Rate via AppStore
cy: Rhoi sgôr ar AppStore

source: Rate [APPNAME]
cy: Rhoi sgôr i [APPNAME]

source: Give your employees the ability to easily and quickly swap shifts with qualified co-workers.
cy: Rhoi'r gallu i'ch gweithwyr cyfnewid sifftiau yn hawdd ac yn gyflym gyda chyd-weithwyr cymwys.

source: Quit
cy: Rhoi'r gorau

source: Quit XDesign
cy: Rhoi'r gorau i XDesign

source: Give us feedback on the App Store.
cy: Rhowch adborth i ni ar yr App Store.

source: Give this message time to stabilise - it updates in real time.
cy: Rhowch amser i'r neges yma sefydlogi - mae'n diweddaru mewn amser real.

source: Give us your feedback
cy: Rhowch eich adborth i ni

source: Please provide your phone number to find people from your contacts.
cy: Rhowch eich rhif ffôn er mwyn dod o hyd i bobl o'ch cysylltiadau.

source: Please enter a first and last name
cy: Rhowch enw cyntaf a chyfenw

source: Please give your filter a name.
cy: Rhowch enw i'ch hidlydd.

source: Enter the full name of your guest and try again.
cy: Rhowch enw llawn eich gwestai a rhowch gynnig arall arni.

source: Go ahead and doodle something fun. You can even doodle while you are recording.
cy: Rhowch gynnig ar sgriblo rhywbeth hwylus. Gallwch hyd yn oed sgriblo tra'ch bod yn recordio.

source: Try out this app, it's awesome! %@
cy: Rhowch gynnig ar yr ap yma, mae'n wych! %@

source: Please try again later!
cy: Rhowch gynnig arall arni nes ymlaen!

source: Please try again when there is an active connection.
cy: Rhowch gynnig arall arni pan mae yna gyswllt gweithredol.

source: Try it for free now using my referral link: <a href="{{URL}}">{{URL}}</a>
cy: Rhowch gynnig arno am ddim gan ddefnyddio fy nolen gyfeirio: <a href="{{URL}}">{{URL}}</a>

source: Rate on the App Store
cy: Rhowch sgôr i ni ar yr App Store

source: Rate us on the App Store
cy: Rhowch sgôr i ni ar yr App Store

source: Rate us!
cy: Rhowch sgôr i ni!

source: Please Rate ISS Finder
cy: Rhowch sgôr i'r ISS Finder

source: Rate it with 5 stars to support future development, it means a world to us!
cy: Rhowch sgôr o 5 seren er mwyn cefnogi datblygiad yn y dyfodol, mae'n golygu llawer i ni!

source: Notify me
cy: Rhowch wybod i mi

source: Between
cy: Rhwng

source: Obstacles
cy: Rhwystrau

source: Block this user
cy: Rhwystro

source: Too long. Maximum %1$s characters.
cy: Rhy hir. Uchafswm y cymeriadau %1$s.

source: Alert
cy: Rhybudd

source: Warning
cy: Rhybudd

source: News Alert
cy: Rhybudd Newyddion

source: WARNING! Are you sure you want to delete your account? This action cannot be undone.
cy: RHYBUDD! Ydych chi'n siŵr eich bod am ddileu eich cyfrif? Ni ellir dadwneud y cam gweithredu hwn.

source: Alerts
cy: Rhybuddion

source: Unlimited alerts
cy: Rhybuddion diderfyn

source: Alerts Off
cy: Rhybuddion i ffwrdd

source: Text alerts
cy: Rhybuddion neges destun

source: Reminder Alerts
cy: Rhybuddion nodiadau atgoffa

source: Alert Subscriptions
cy: Rhybuddion Tanysgrifiadau

source: Weather Alerts
cy: Rhybuddion tywydd

source: Alerts On
cy: Rhybuddion ymlaen

source: Release to Refresh
cy: Rhyddhewch i adnewyddu

source: Nautical Rhumbs
cy: Rhymlinau Morwrol

source: Interaction
cy: Rhyngweithio

source: Friendly Interaction
cy: Rhyngweithio Cyfeillgar

source: Updated interface:
cy: Rhyngwyneb wedi'i diweddaru:

source: Gender
cy: Rhyw

source: Somewhere
cy: Rhywle

source: New like
cy: Rhywun newydd wedi hoffi

source: Name mentions
cy: Rhywun yn sôn am fy enw

source: %{NUM_PEOPLE} %{PEOPLE} were here
cy: Roedd %{NUM_PEOPLE} %{PEOPLE} yma

source: was at
cy: roedd am

source: Expected URL to be a file URL
cy: Roedd disgwyl i'r URL fod yn URL ffeil

source: An unknown error occurred, please try again.
cy: Roedd gwall anhysbys, rhowch gynnig arall arni.

source: There was a communication error with the server. Please try again.
cy: Roedd gwall cyfathrebu gyda'r gweinydd. Rhowch gynnig arall arni.

source: There was an error retrieving the image, please try again!
cy: Roedd gwall wrth adfer y llun, rhowch gynnig arall arni!

source: There was an error during your iCloud authorization. Please try again
cy: Roedd gwall wrth awdurdodi iCloud. Rhowch gynnig arall arni

source: There was an error during your Twitter authentication. Please, try again
cy: Roedd gwall wrth awdurdodi Twitter. Rhowch gynnig arall arni

source: There was a problem while updating your profile
cy: Roedd gwall wrth ddiweddaru'ch proffil

source: There was an error updating your profile, please try again!
cy: Roedd gwall wrth ddiweddaru'ch proffil, rhowch gynnig arall arni!

source: Error occurred while importing
cy: Roedd gwall wrth fewngludo

source: There was an error connecting to the server.
cy: Roedd gwall wrth gysylltu â'r gweinydd.

source: Error occurred while loading your file
cy: Roedd gwall wrth lwytho'ch ffeil

source: Error occurred while loading file
cy: Roedd gwall wrth lwytho'r ffeil

source: An error occured while sharing.
cy: Roedd gwall wrth rannu.

source: Error occurred while uploading file
cy: Roedd gwall wrth uwchlwytho'r ffeil

source: An error occured. Please contact our support.
cy: Roedd gwall. Cysylltwch â'n tîm cefnogaeth.

source: Whoops! Something went wrong, please try again later.
cy: Roedd gwall. Rhowch gynnig arall arni yn ddiweddarach.

source: There was an error. Please try again later.
cy: Roedd gwall. Rhowch gynnig arall arni'n nes ymlaen.

source: There was some unknown problem. Sorry for inconvenience, we've already been investigating the issue.
cy: Roedd problem anhysbys. Mae'n flin gennym am yr anghyfleustra, rydym eisoes yn ymchwilio i'r mater.

source: There was a problem with your Internet connection
cy: Roedd problem gyda'ch cysylltiad rhyngrwyd

source: Problem Restoring Purchases: %@
cy: Roedd problem wrth adfer yr eitemau: %@

source: Problem Saving to Camera Roll
cy: Roedd problem wrth gadw i'r rhôl camera

source: There was a problem unfavoriting the photo.
cy: Roedd problem wrth dad-wneud y llun hwn yn ffefryn.

source: We hit a snag when connecting to the server.
cy: Roedd problem wrth gysylltu â'r gweinydd.

source: There was a problem editing this photo.
cy: Roedd problem wrth olygu'r llun hwn.

source: There was a problem favoriting the photo.
cy: Roedd problem wrth wneud y llun hwn yn ffefryn.

source: Email address was invalid
cy: Roedd y cyfeiriad e-bost yn annilys

source: Verification successful.
cy: Roedd y dilysiad yn llwyddiannus.

source: Phone number was invalid
cy: Roedd y rhif ffôn yn annilys

source: There Was a Problem
cy: Roedd yna broblem

source: Export was successful
cy: Roedd yr allgludo'n llwyddiannus

source: Role
cy: Rôl

source: Russia
cy: Rwsia

source: I feel lucky!
cy: Rwy'n teimlo'n lwcus!

source: I forgot my password
cy: Rwyf wedi anghofio fy nghyfrinair

source: You unlocked a new player!
cy: Rwyt ti wedi datgloi chwaraewraig newydd!

source: I want to learn…
cy: Rydw i eisiau dysgu…

source: I already rated this version :)
cy: Rydw i eisoes wedi sgorio'r fersiwn hwn :)

source: Dude, I am serious! manually kill the app - NOW.
cy: Rydw i'n hollol o ddifrif! Diffodd yr ap fy hun - NAWR.

source: You are now connected to your contacts.
cy: Rydych chi bellach wedi eich cysylltu â'ch cysylltiadau.

source: %@ and you are now friends!
cy: Rydych chi bellach yn ffrindiau gyda %@!

source: %s and you are now friends!
cy: Rydych chi bellach yn ffrindiau gyda %s!

source: You've been removed from %s
cy: Rydych chi wedi cael eich tynnu o %s

source: You have canceled in-app purchase. Could you let us know why?
cy: Rydych chi wedi canslo'ch pryniant o fewn yr ap. Allwch chi roi gwybod pam?

source: You leveled up!
cy: Rydych chi wedi cyrraedd y lefel nesaf!

source: You've covered 25 thousand %@!
cy: Rydych chi wedi teithio 25 mil %@!

source: You've visited 5 different countries!
cy: Rydych chi wedi ymweld â 5 gwlad wahanol!

source: You've visited 5 different airports!
cy: Rydych chi wedi ymweld â 5 maes awyr gwahanol!

source: You've already added this ticket to Passbook
cy: Rydych eiseos wedi ychwanegu'r tocyn hwn i Passbook

source: You've already added %@ to your filter.
cy: Rydych eisoes wedi ychwanegu %@ at eich hidlydd.

source: You got mail :)
cy: Rydych wedi derbyn neges :)

source: You've entered wrong confirmation code
cy: Rydych wedi nodi'r cod dilysu anghywir

source: You're at %@
cy: Rydych yn %@

source: You're struggling to complete this task.
cy: Rydych yn cael trafferth yn cwblhau'r dasg hon.

source: We are going to send an SMS with a verification code to this number: %s
cy: Rydym am anfon neges SMS gyda chod dilysu i'r rhif yma: %s

source: We need permission to access your Facebook account in order to show you friends that are also using [APPNAME]
cy: Rydym angen caniatâd i gael mynediad at eich cyfrif Facebook er mwyn dangos i chi pa rai o'ch ffrindiau sydd hefyd yn defnyddio [APPNAME]

source: We need permission to access your Facebook account in order to log you in using Facebook.
cy: Rydym angen caniatâd i gael mynediad at eich cyfrif Facebook er mwyn eich mewngofnodi gan ddefnyddio Facebook.

source: We do need your authorization in order to avoid spam
cy: Rydym angen eich awdurdod er mwyn osgoi sbam

source: We do need your Facebook authorization in order to avoid spam
cy: Rydym angen i chi awdurdodi Facebook er mwyn osgoi sbam

source: We've sent you instructions on how to reset your password.
cy: Rydym wedi anfon cyfarwyddiadau atoch ar sut i ailosod eich cyfrinair.

source: We sent you an email with password reset instructions
cy: Rydym wedi anfon e-bost atoch gyda chyfarwyddiadau i ailosod eich cyfrinair

source: WE HAVE UPDATED OUR TERMS AND CONDITIONS
cy: RYDYM WEDI DIWEDDARU EIN TELERAU AC AMODAU

source: We improved the app and added some cool new stuff.
cy: Rydym wedi gwella'r ap ac ychwanegu nodweddion newydd gwych.

source: We use Facebook to find your friends. We'll never post to your wall without permission.
cy: Rydym yn defnyddio Facebook i ddod o hyd i'ch ffrindiau. Ni fyddwn byth yn postio i'ch wal heb ganiatâd.

source: We're working on it - stay tuned
cy: Rydym yn gweithio arni - parhewch i wylio

source: We bet [USERNAME] would like to know what you’re up to.
cy: Rydym yn mentro y byddai [USERNAME] yn hoffi gwybod eich hanes.

source: Position
cy: Safle

source: Job Site
cy: Safle gweithio

source: Job Sites
cy: Safleoedd Gweithio

source: Standard
cy: Safonol
